ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/UC13_0_I2CC_1.0.xml
        <register id="UC13_0_I2CC_ICLR" width="32" offset="0x28" description="Interrupt clear">
            <bitfield id="RXDONE" description="Receive Data Interrupt
Signals that a byte has been received" begin="0" end="0" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TIMEOUTA" description="Timeout A interrupt" begin="12" end="12" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="NACK" description="Address/Data NACK Interrupt" begin="7" end="7" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="START" description="START Detection Interrupt" begin="8" end="8" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="STOP" description="STOP Detection Interrupt" begin="9" end="9" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="ARBLOST" description="Arbitration Lost Interrupt" begin="10" end="10" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXDONE" description="Transmit Transaction completed Interrupt" begin="1" end="1" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXTRG" description="Receive Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="TXTRG" description="Transmit FIFO Trigger" begin="3" end="3" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="DMA_DONE_TX" description="DMA Done on Event Channel TX" begin="16" end="16" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="DMA_DONE_RX" description="DMA Done on Event Channel RX" begin="15" end="15" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Interrupt disabled"/>
                <bitenum id="CLR" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
            <bitfield id="RXFULL" description="RXFIFO full event." begin="4" end="4" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
            <bitfield id="TXEMPTY" description="Transmit FIFO Empty interrupt mask. This interrupt is set if all data in the Transmit FIFO have been shifted out and the transmit goes into idle mode." begin="5" end="5" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Writing 0 has no effect"/>
                <bitenum id="CLR" value="0x1" description="Clear Interrupt"/>
            </bitfield>
        </register>
        </group>
    <group id="UC13_0_I2CC_DMA_TRIG1" name="UC13_0_I2CC_DMA_TRIG1" instances="1" offset="0x1050" instaddr="0x30" description="">
        <register id="UC13_0_I2CC_DMA_TRIG1_IMASK" width="32" offset="0x8" description="Interrupt mask">
            <bitfield id="RXTRG" description="Receive Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC13_0_I2CC_DMA_TRIG1_RIS" width="32" offset="0x10" description="Raw interrupt status">
            <bitfield id="RXTRG" description="Receive Trigger
				    When FIFO is present, trigger when RX FIFO contains &gt;= defined bytes
				    when FIFO is not present, this indicates when buffer is full" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC13_0_I2CC_DMA_TRIG1_MIS" width="32" offset="0x18" description="Masked interrupt status">
            <bitfield id="RXTRG" description="Receive Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="CLR" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
        <register id="UC13_0_I2CC_DMA_TRIG1_ISET" width="32" offset="0x20" description="Interrupt set">
            <bitfield id="RXTRG" description="Receive Trigger" begin="2" end="2" width="1" rwaccess="R/W">
                <bitenum id="NO_EFFECT" value="0x0" description="Clear Interrupt Mask"/>
                <bitenum id="SET" value="0x1" description="Set Interrupt Mask"/>
            </bitfield>
        </register>
